Repository: Infyneis/myself_2.0
Catalog: lib/l10n/app_*.arb
Languages: fr

# appTitle
source: Myself 2.0
fr: Moi-même 2.0

source: My Affirmations
fr: Mes Affirmations

# myAffirmationsHint
source: Navigate to view all your affirmations
fr: Naviguer pour voir toutes vos affirmations

source: Settings
fr: Paramètres

# settingsHint
source: Navigate to app settings
fr: Naviguer vers les paramètres de l'application

source: Tap to refresh
fr: Appuyez pour actualiser

source: Swipe to refresh
fr: Balayez pour actualiser

source: Refresh
fr: Actualiser

source: Refresh affirmation
fr: Actualiser l'affirmation

# showNewAffirmation
source: Show a new affirmation
fr: Afficher une nouvelle affirmation

# createFirstAffirmation
source: Create Your First Affirmation
fr: Créer Votre Première Affirmation

source: Add Affirmation
fr: Ajouter une Affirmation

# createNewAffirmation
source: Create a new affirmation
fr: Créer une nouvelle affirmation

source: Edit affirmation
fr: Modifier l'affirmation

source: Delete affirmation
fr: Supprimer l'affirmation

source: New Affirmation
fr: Nouvelle Affirmation

# editAffirmationTitle
source: Edit Affirmation
fr: Modifier l'Affirmation

source: Save
fr: Enregistrer

source: Cancel
fr: Annuler

# affirmationPlaceholder
source: Enter your affirmation...
fr: Entrez votre affirmation...

# charactersRemaining
source: {count} characters remaining
fr: {count} caractères restants

# charactersOver
source: {count} characters over limit
fr: {count} caractères au-delà de la limite

source: Unsaved Changes
fr: Modifications Non Enregistrées

# unsavedChangesMessage
source: You have unsaved changes. Are you sure you want to leave?
fr: Vous avez des modifications non enregistrées. Êtes-vous sûr de vouloir quitter ?

source: Leave
fr: Quitter

source: Stay and Edit
fr: Rester et Modifier

source: Affirmation cannot be empty
fr: L'affirmation ne peut pas être vide

# affirmationTooLong
source: Affirmation exceeds 280 characters
fr: L'affirmation dépasse 280 caractères

# affirmationSaved
source: Affirmation saved successfully
fr: Affirmation enregistrée avec succès

# deleteAffirmationTitle
source: Delete Affirmation?
fr: Supprimer l'Affirmation ?

# deleteAffirmationMessage
source: Are you sure you want to delete this affirmation? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer cette affirmation ? Cette action ne peut pas être annulée.

source: Delete
fr: Supprimer

source: Affirmation deleted
fr: Affirmation supprimée

source: No Affirmations Yet
fr: Aucune Affirmation Pour le Moment

# createFirstAffirmationMessage
source: Start your journey by creating your first affirmation. It will appear here and on your home widget.
fr: Commencez votre voyage en créant votre première affirmation. Elle apparaîtra ici et sur votre widget d'accueil.

source: Get Started
fr: Commencer

source: Appearance
fr: Apparence

source: Theme
fr: Thème

# chooseTheme
source: Choose your preferred theme
fr: Choisissez votre thème préféré

# themeLight
source: Light
fr: Clair

# themeLightDescription
source: Bright and clear
fr: Lumineux et net

# themeDark
source: Dark
fr: Sombre

# themeDarkDescription
source: Easy on the eyes
fr: Doux pour les yeux

# themeSystem
source: System
fr: Système

# themeSystemDescription
source: Matches your device
fr: Correspond à votre appareil

source: Font Size
fr: Taille de Police

# fontSizeDescription
source: Adjust text size for better readability
fr: Ajustez la taille du texte pour une meilleure lisibilité

# fontSizeSmall
source: Small
fr: Petit

# fontSizeDefault
source: Default
fr: Par Défaut

# fontSizeLarge
source: Large
fr: Grand

# fontSizeExtraLarge
source: Extra Large
fr: Très Grand

source: Widget Settings
fr: Paramètres du Widget

source: Refresh Mode
fr: Mode d'Actualisation

# refreshModeDescription
source: When to show a new affirmation
fr: Quand afficher une nouvelle affirmation

# refreshModeUnlock
source: Every Unlock
fr: À Chaque Déverrouillage

# refreshModeUnlockDescription
source: New affirmation each time you unlock your phone
fr: Nouvelle affirmation à chaque fois que vous déverrouillez votre téléphone

# refreshModeHourly
source: Hourly
fr: Toutes les Heures

# refreshModeHourlyDescription
source: New affirmation every hour
fr: Nouvelle affirmation toutes les heures

# refreshModeDaily
source: Daily
fr: Quotidien

# refreshModeDailyDescription
source: New affirmation once a day
fr: Nouvelle affirmation une fois par jour

source: Widget Rotation
fr: Rotation du Widget

# widgetRotationDescription
source: Allow affirmations to change on home widget
fr: Permettre aux affirmations de changer sur le widget d'accueil

source: Enabled
fr: Activé

source: Disabled
fr: Désactivé

source: Preferences
fr: Préférences

source: Language
fr: Langue

# languageDescription
source: Choose your preferred language
fr: Choisissez votre langue préférée

# languageFrench
source: Fran√ßais
fr: Français

# welcomeTitle
source: Welcome to Myself 2.0
fr: Bienvenue dans Moi-même 2.0

# welcomeSubtitle
source: Transform through repetition and intention
fr: Se transformer par la répétition et l'intention

# welcomeDescription
source: Myself 2.0 helps you become who you want to be through the power of daily affirmations. See yourself, become yourself.
fr: Moi-même 2.0 vous aide à devenir qui vous voulez être grâce au pouvoir des affirmations quotidiennes. Voyez-vous, devenez vous-même.

source: Let's Begin
fr: Commençons

source: Congratulations!
fr: Félicitations !

# firstAffirmationCreated
source: You've created your first affirmation
fr: Vous avez créé votre première affirmation

# continueButton
source: Continue
fr: Continuer

# widgetSetupTitle
source: Add to Your Home Screen
fr: Ajouter à Votre Écran d'Accueil

# widgetSetupDescription
source: See your affirmations every time you unlock your phone by adding the Myself widget to your home screen.
fr: Voyez vos affirmations chaque fois que vous déverrouillez votre téléphone en ajoutant le widget Moi-même à votre écran d'accueil.

# widgetSetupIosInstructions
source: 1. Long press on your home screen 2. Tap the + button in the top corner 3. Search for "Myself" 4. Choose your preferred widget size 5. Tap "Add Widget"
fr: 1. Appuyez longuement sur votre écran d'accueil 2. Appuyez sur le bouton + dans le coin supérieur 3. Recherchez "Moi-même" 4. Choisissez la taille de widget préférée 5. Appuyez sur "Ajouter Widget"

# widgetSetupAndroidInstructions
source: 1. Long press on your home screen 2. Tap "Widgets" 3. Find "Myself" in the list 4. Long press and drag to your home screen 5. Choose your preferred size
fr: 1. Appuyez longuement sur votre écran d'accueil 2. Appuyez sur "Widgets" 3. Trouvez "Moi-même" dans la liste 4. Appuyez longuement et faites glisser vers votre écran d'accueil 5. Choisissez votre taille préférée

source: Got It
fr: Compris

source: Skip for Now
fr: Passer Pour l'Instant

source: Error loading affirmations
fr: Erreur lors du chargement des affirmations

source: Error saving affirmation
fr: Erreur lors de l'enregistrement de l'affirmation

source: Error deleting affirmation
fr: Erreur lors de la suppression de l'affirmation

source: Try Again
fr: Réessayer

source: Affirmation card
fr: Carte d'affirmation

# closeButton
source: Close
fr: Fermer

# backButton
source: Back
fr: Retour

# widgetSetupStepIos1Title
source: Long press on your home screen
fr: Appuyez longuement sur votre écran d'accueil

# widgetSetupStepIos1Desc
source: Press and hold any empty area on your home screen
fr: Appuyez et maintenez n'importe quelle zone vide sur votre écran d'accueil

# widgetSetupStepIos2Title
source: Tap the + button
fr: Appuyez sur le bouton +

# widgetSetupStepIos2Desc
source: Look for the plus icon in the top-left corner
fr: Recherchez l'icône plus dans le coin supérieur gauche

# widgetSetupStepIos3Title
source: Search for "Myself 2.0"
fr: Recherchez "Moi-même 2.0"

# widgetSetupStepIos3Desc
source: Find our app in the widget gallery
fr: Trouvez notre application dans la galerie de widgets

# widgetSetupStepIos4Title
source: Choose your widget size
fr: Choisissez la taille de votre widget

# widgetSetupStepIos4Desc
source: Select small, medium, or large
fr: Sélectionnez petit, moyen ou grand

# widgetSetupStepIos5Title
source: Add Widget
fr: Ajouter Widget

# widgetSetupStepIos5Desc
source: Tap "Add Widget" and you're done!
fr: Appuyez sur "Ajouter Widget" et c'est fait !

# widgetSetupStepAndroid1Title
source: Long press on your home screen
fr: Appuyez longuement sur votre écran d'accueil

# widgetSetupStepAndroid1Desc
source: Press and hold any empty area on your home screen
fr: Appuyez et maintenez n'importe quelle zone vide sur votre écran d'accueil

# widgetSetupStepAndroid2Title
source: Tap "Widgets"
fr: Appuyez sur "Widgets"

# widgetSetupStepAndroid2Desc
source: Select the widgets option from the menu
fr: Sélectionnez l'option widgets dans le menu

# widgetSetupStepAndroid3Title
source: Find "Myself 2.0"
fr: Trouvez "Moi-même 2.0"

# widgetSetupStepAndroid3Desc
source: Scroll or search for our app
fr: Faites défiler ou recherchez notre application

# widgetSetupStepAndroid4Title
source: Drag the widget
fr: Faites glisser le widget

# widgetSetupStepAndroid4Desc
source: Hold and drag the widget to your home screen
fr: Maintenez et faites glisser le widget vers votre écran d'accueil

# widgetSetupStepAndroid5Title
source: Release to place
fr: Relâchez pour placer

# widgetSetupStepAndroid5Desc
source: Drop it where you want and you're done!
fr: Déposez-le où vous voulez et c'est fait !
